[
  {
    "id": 1,
    "title": "Book your tickets now – the Mercury has risen!",
    "content": "Last week, the Mercury Theatre Colchester held a ceremony to mark the venue's reopening following the three-year Mercury Rising campaign which raised £11.3 million to reimagine the theatre and improve accessibility throughout. Congratulations to the wonderful team at The Mercury, who I loved working with, for coming so far and getting this done during this crazily challenging time. I can't wait to visit and see, what looks from the pictures, to be a truly amazing new theatre building. I'm so very proud that I played a small role in this transformation – off-stage, rather than on, of course!\n\n\"Sue has provided our Development Team with invaluable help and support towards our Trust and Foundation programme to support both our revenue activities and our £11.3 million capital campaign. We really couldn't have done it without her. She's provided a wealth of detailed knowledge, provided coaching and support for staff and guided us – myself and the team – through the whole process. We can't recommend Sue highly enough.\" (Steve Mannix, Executive Director)",
    "category": "Success Stories",
    "date": "2021-07-03T10:00:00.000Z",
    "excerpt": "Last week, the Mercury Theatre Colchester held a ceremony to mark the venue's reopening following the three-year Mercury Rising campaign which raised £11.3 million..."
  },
  {
    "id": 2,
    "title": "Being a fundraising consultant is truly the best job in the world!",
    "content": "Recently I worked with another amazing charity called Hope for the Young on a successful Big Lottery application. Hope for the Young makes a real difference to the lives of young refugees and asylum-seekers by:\n\n• Providing a one-to-one mentoring service which offers support and advice to young asylum-seekers when they first arrive in the UK on matters ranging from language development and study skills, to emotional support and confidence building.\n• Providing grants to support young refugees and asylum seekers who have no access to government funds, or to those who are facing extreme financial hardship, to complete their education.\n\nHead of Programmes and Development, Matt Blacker, was over the moon when he found out that the application had been successful because, as he said, \"This is going to cause a step-change in the way Hope for the Young operates. Our team is going to increase, our core infrastructure is going to become stronger … Most importantly, it means we are going to be able to focus more time and energy on those we are here to support.\"\n\nHe went on to say, \"You were instrumental in helping us shape our National Lottery proposal, resulting in this multi-year grant. Your knowledge and expertise shone through any questions we had throughout the process. I learnt a lot in a short space of time with your guidance and you helped ensure the application was the best it could be. You were also there at very short notice to give advice and I really appreciate this. We could not be more grateful for your support.\"\n\nThere ends another highly satisfactory week!",
    "category": "Success Stories",
    "date": "2019-10-18T15:53:29.000Z",
    "excerpt": "Recently I worked with another amazing charity called Hope for the Young on a successful Big Lottery application. Hope for the Young makes a real difference to the lives of young refugees and asylum-seekers..."
  },
  {
    "id": 3,
    "title": "A testimonial from Vishal Talreja, CEO of Dream a Dream, that made my day!",
    "content": "\"We engaged Sue to help us in our fundraising efforts in the UK. Dream a Dream is a charitable organization based out of Bangalore, India. We setup a UK fundraising office in 2013 and were looking to build our support base from Foundations in the UK. We engaged Sue in 2016 to help us research and apply for grants to foundations in the UK which had an interest in children and international development. Sue was meticulous and thorough in her research and recommended a set of interesting foundations for us to seek support from along with insights on what our approach should be. Sue also helped us prepare Letters of Interest and Request for Support applications for the short-listed foundations.\n\nSue helped us gain much needed insight on how we should frame our applications, taught us to align our language to the areas of focus of the potential donor and helped us build a crisp, concise and clear messaging of our work and impact. Sue worked with Dream a Dream's fundraising team and helped us understand the nuances of proposal writing, shared her own experiences of what makes a good proposal and was an excellent coach. Her inputs were extremely valuable to enhancing our skills, improve the quality of our proposals and be more articulate in our messaging.\n\nSue is a remarkable consultant, fundraiser and coach. She is thorough, detail-oriented and deeply invested in her client's success. She is experienced, well-versed with how donors think and brings the donor perspective in a client's thinking and approach to proposal writing. She is a valuable resource for any non-profit.\"",
    "category": "Testimonials",
    "date": "2018-01-23T12:00:00.000Z",
    "excerpt": "\"We engaged Sue to help us in our fundraising efforts in the UK. Dream a Dream is a charitable organization based out of Bangalore, India. We setup a UK fundraising office in 2013..."
  },
  {
    "id": 4,
    "title": "Always happy to be of use!",
    "content": "Here's what Naturewatch Foundation had to say about the E-coaching service:\n\n\"Sue has worked wonders for our small charity. Her guidance has not only helped with applying for grants, but has also assisted in other areas of our work, especially in writing fundraising letters and copy for our website. Sue taught me the art of being succinct, whilst using creative and positive language to get my message across. She is very patient and has a gentle yet direct approach to coaching. I highly recommend Sue, and will continue to use her services myself for any future grant applications.\"",
    "category": "Testimonials",
    "date": "2016-10-10T15:59:36.000Z",
    "excerpt": "Here's what Naturewatch Foundation had to say about the E-coaching service: 'Sue has worked wonders for our small charity. Her guidance has not only helped with applying for grants...'"
  },
  {
    "id": 5,
    "title": "More Good News for Phoenix Futures",
    "content": "With support from Sue, Phoenix Futures was recently awarded a grant of £450,000 from The Big Lottery Fund. The grant, spread over five years, will support 'Recovery through Nature', a programme that engages teams of service-users recovering from drug or alcohol addiction in practical conservation as part of their rehabilitation.\n\nThe grant will provide this proven and truly innovative therapeutic programme with the financial stability it needs to change the lives of even more individuals recovering from substance addiction in England.\n\nCongratulations Phoenix Futures!",
    "category": "Success Stories",
    "date": "2015-07-06T16:42:47.000Z",
    "excerpt": "With support from Sue, Phoenix Futures was recently awarded a grant of £450,000 from The Big Lottery Fund. The grant, spread over five years, will support 'Recovery through Nature'..."
  },
  {
    "id": 6,
    "title": "St John Ambulance – Another Satisfied Client",
    "content": "Sue has completed over three years with St John Ambulance, the UK's leading provider of first aid training in the UK. When Sue started with St John Ambulance they were going through a period of transition, and she was asked to hold the trust fundraising reins for a short time. Contracted to support trust fundraising for four days a month, trust income shot up by around 500% in her first year. St John Ambulance followed this up with a request for Sue to sign a further 2-year contract.\n\nEarly in 2015 that contract came to an end. St John Ambulance now has a full in-house trust fundraising team and a firm footing from which to continue their trust fundraising activities.\n\nTegan Jones, Head of Fundraising, when asked to comment on Sue's input said, \"Sue has been a tremendous resource to St John Ambulance and has always displayed an excellent understanding of trust fundraising engagement techniques; a clear understanding of the reporting expectations of trust funders and how charities should ensure that proposed projects are structured to ensure impact is accurately measured. Sue has an excellent understanding of the UK trust landscape and expert knowledge of so many funding bodies. I would have no hesitation in utilising her services in the future.\"",
    "category": "Success Stories",
    "date": "2015-03-15T06:43:00.000Z",
    "excerpt": "Sue has completed over three years with St John Ambulance, the UK's leading provider of first aid training in the UK. When Sue started with St John Ambulance they were going through a period of transition..."
  },
  {
    "id": 7,
    "title": "Great way to end 2014 for DreamArts",
    "content": "Just before Christmas, DreamArts received the news that their application for funding to The Henry Smith Charity, prepared with support from Sue, had been successful. The Westminster-based charity, which uses creative arts to encourage vulnerable children and young people to explore who they are, challenge unhealthy thinking and build positive relationships, were awarded a grant of £46,200.\n\nThe grant will pay for an important three-year project that aims to use a range of creative arts as tools to steer 60 vulnerable young women living in the most deprived areas of Westminster away from crime and anti-social behaviour, and to improve their resilience against future harm.",
    "category": "Success Stories",
    "date": "2014-12-26T10:00:00.000Z",
    "excerpt": "Just before Christmas, DreamArts received the news that their application for funding to The Henry Smith Charity, prepared with support from Sue, had been successful..."
  },
  {
    "id": 8,
    "title": "Always happy to receive new testimonials!",
    "content": "I met Sue for the first time in 2013 and employed her in a freelance capacity a few weeks later to provide our charity with trust research and new funding applications.\n\nSue proved to be a hardworking and highly organised colleague, with good communication skills that she then utilised to produce much needed successful funding applications.\n\nI highly recommend Sue and am sure that she will provide you with the same level of expertise that she afforded us.\n\nIf you have any specific questions, please feel free to contact me for more details.\n\nAndrew Dunham\nProject Funder\nAspire\nandrew.dunham@aspire.org.uk",
    "category": "Testimonials",
    "date": "2014-09-24T14:00:00.000Z",
    "excerpt": "I met Sue for the first time in 2013 and employed her in a freelance capacity a few weeks later to provide our charity with trust research and new funding applications..."
  },
  {
    "id": 9,
    "title": "Congratulations to Phoenix Futures",
    "content": "Congratulations to Phoenix Futures! Sue has been working with Phoenix for some years now and recently helped them to secure a donation of £50,000 from The J Paul Getty Jnr Charitable Trust towards the life-changing Recovery Through Nature Programme. Sadly this is among one of the last grants that will ever be awarded by the Trust as they are now in the process of winding down.",
    "category": "Success Stories",
    "date": "2013-08-05T11:00:00.000Z",
    "excerpt": "Congratulations to Phoenix Futures! Sue has been working with Phoenix for some years now and recently helped them to secure a donation of £50,000 from The J Paul Getty Jnr Charitable Trust..."
  },
  {
    "id": 10,
    "title": "TRUST-FUNDRAISING.CO.UK LAUNCHES E-COACHING SERVICE",
    "content": "To mark the beginning of a new and for many, austere, financial year trust-fundraising.co.uk has launched the e-coaching service for trust, foundation and statutory fundraisers.\n\nThe objectives of the service, which has been developed over a six-month pilot, are to cultivate and improve in-house talent. E-coaching aims not only to develop new successful grant-seekers, but also to bring fresh ideas to more experienced fundraisers.\n\nRather than simply reviewing and correcting applications, the email-based service run by Director, Sue Crow, encourages the fundraiser to consider for themselves why certain elements of their application may not be successful with the grant-maker.\n\nSue assists the fundraiser to approach the application with a fresh mind, questioning each section of the document, considering the thought processes of the grant-maker and answering their questions before they arise. This new innovative service will improve charities' in-house skills set whilst also increasing their chances of fundraising success.\n\nSport4Life was one of the first charities to sign up to the e-coaching pilot. With support from trust-fundraising.co.uk the charity developed a successful application to The Big Lottery, securing a grant of £289,768.\n\nSport4Life Manager James Forrest said: 'The e-coaching from Sue has been exceptionally beneficial to our small charity. It has helped to raise the skill set and knowledge of those responsible for fundraising, and in turn enabled us to achieve excellent successes with recent grant and trust bids.'",
    "category": "Industry News",
    "date": "2012-04-12T09:30:23.000Z",
    "excerpt": "To mark the beginning of a new and for many, austere, financial year trust-fundraising.co.uk has launched the e-coaching service for trust, foundation and statutory fundraisers..."
  }
]
